---
kind: property
id: P:Autodesk.Revit.DB.MEPCalculationServerInfo.ServerId
source: html/55af3374-ce2b-fa78-8086-6215750ec3b9.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.ServerId Property

The Id of the server.

## Syntax (C#)
```csharp
public Guid ServerId { get; set; }
```